Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you run the Infinispan Server image, pass the `USER="admin"` and `PASS="password"` parameters.
ja_jp: Infinispan Server イメージを実行する場合は、 `USER="admin"` と `PASS="password"` のパラメータを渡します。

source: If you run the bare metal distribution, use the Command Line Interface (CLI) as follows:
ja_jp: ベアメタル・ディストリビューションを実行する場合は、次のようにコマンドライン・インターフェース（CLI）を使用します:

source: If you run the project with:
ja_jp: 次のコマンドでプロジェクトを実行する場合:

source: If you search more information about OpenTelemetry Metrics, please refer to the xref:opentelemetry-metrics.adoc[OpenTelemetry Metrics Guide].
ja_jp: OpenTelemetry Metrics の詳細情報を検索する場合は、xref:opentelemetry-metrics.adoc[OpenTelemetry Metrics ガイド] を参照してください。

source: If you search more information about OpenTelemetry Tracing, please refer to the xref:opentelemetry-tracing.adoc[OpenTelemetry Tracing Guide].
ja_jp: OpenTelemetry Tracing の詳細情報を確認する場合は、xref:opentelemetry-tracing.adoc[OpenTelemetry Tracing ガイド] を参照してください。

source: If you see the Person object as Person<1>, then the object has not been converted. In this case, add the dependency `quarkus-rest-jackson` in `pom.xml`.
ja_jp: Person オブジェクトが Person<1> として表示される場合は、オブジェクトが変換されていません。この場合、 `pom.xml` に依存関係 `quarkus-rest-jackson` を追加します。

source: If you see the Person object as Person<1>, then the object has not been converted. In this case, add the dependency `quarkus-resteasy-reactive-jackson` in `pom.xml`.
ja_jp: PersonオブジェクトがPerson<1>と表示される場合は、オブジェクトが変換されていないことになります。この場合、 `pom.xml` の依存関係 `quarkus-resteasy-reactive-jackson` を追加してください。

source: If you see the following invalid path error for your application JAR when trying to create a native executable using a container build, even though your JAR was built successfully, you're most likely using a remote daemon for your container runtime.
ja_jp: JARが正常にビルドされているにもかかわらず、コンテナービルドでネイティブ実行可能ファイルを作成しようとすると、アプリケーションJARに対して以下のようなinvalid pathエラーが表示される場合は、コンテナーランタイムにリモートデーモンを使用している可能性があります。

source: If you send objects with this AMQP connector (outbound connector), it gets encoded as JSON and sent as binary. The `content-type` is set to `application/json`. So, you can rebuild the object as follows:
ja_jp: この AMQP コネクター (アウトバウンドコネクター) を使用してオブジェクトを送信すると、JSON としてエンコードされ、バイナリーとして送信されます。 `content-type` は `application/json` に設定されます。したがって、次のようにオブジェクトを再構築できます。

source: If you send objects with this RabbitMQ connector (outbound connector), they are encoded as JSON and sent with `content_type` set to `application/json`. You can receive this payload using (Vert.x) JSON Objects, and then map it to the object class you want:
ja_jp: この RabbitMQ コネクター (アウトバウンドコネクター) を使用してオブジェクトを送信する場合、オブジェクトは JSON としてエンコードされ、 `content_type` を `application/json` に設定されて送信されます。このペイロードは、(Vert.x) JSON オブジェクトを使用して受け取り、任意のオブジェクトクラスにマップできます。

source: If you set `quarkus.oidc.client-id` but your endpoint does not require a remote access to one of OpenID Connect Provider endpoints (introspection, token acquisition, etc) then do not set a client secret with the `quarkus.oidc.credentials` or similar properties as it will not be used.
ja_jp: `quarkus.oidc.client-id` を設定したが、エンドポイントが OpenID Connect プロバイダーエンドポイントの 1 つへのリモートアクセスを必要としない場合は (イントロスペクション、トークン取得など)、 `quarkus.oidc.credentials` または同様のプロパティーでクライアントシークレットを設定しないでください。使用されないためです。

source: If you set `quarkus.oidc.client-id` but your endpoint does not require remote access to one of OpenID Connect Provider endpoints (introspection, token acquisition, etc.) then do not set a client secret with the `quarkus.oidc.credentials` or similar properties as it will not be used.
ja_jp: `quarkus.oidc.client-id` を設定したが、エンドポイントが OpenID Connect プロバイダーエンドポイントの 1 つへのリモートアクセスを必要としない場合は (イントロスペクション、トークン取得など)、 `quarkus.oidc.credentials` または同様のプロパティーでクライアントシークレットを設定しないでください。使用されないためです。

source: If you set `quarkus.oidc.client-id`, but your endpoint does not require remote access to one of the OIDC provider endpoints (introspection, token acquisition, and so on), do not set a client secret with `quarkus.oidc.credentials` or similar properties because it will not be used.
ja_jp: `quarkus.oidc.client-id` を設定したが、いずれかの OIDC プロバイダーエンドポイントへのリモートアクセスがエンドポイントに必要ない場合 (イントロスペクション、トークンの取得など)、 `quarkus.oidc.credentials` または同様のプロパティーを使用してクライアントシークレットを設定しないでください。その場合、クライアントシークレットは使用されないためです。

source: If you set `quarkus.oidc.devui.grant.type=client` then a `client_credentials` grant will be used to acquire a token, with the page showing no `User` field in this case:
ja_jp: `quarkus.oidc.devui.grant.type=client` を設定すると、トークンの取得に `client_credentials` グラントが使用されます。この場合、ページに `User` フィールドは表示されません。

source: If you set `quarkus.oidc.devui.grant.type=client`, then a `client_credentials` grant is used to acquire a token, with the page showing no *User* field in this case:
ja_jp: `quarkus.oidc.devui.grant.type=client` を設定すると、トークンの取得に `client_credentials` グラントが使用されます。この場合、ページに *User* フィールドは表示されません。

source: If you set `quarkus.oidc.devui.grant.type=code` in `application.properties` (this is a default value) then an `authorization_code` grant will be used to acquire both access and ID tokens. Using this grant is recommended to emulate a typical flow where a `Single Page Application` acquires the tokens and uses them to access Quarkus services.
ja_jp: `application.properties` で `quarkus.oidc.devui.grant.type=code` (デフォルト値) を設定すると、 `authorization_code` 許可を使用してアクセストークンと ID トークンの両方が取得されます。この許可を使用して、 `Single Page Application` がトークンを取得し、それらを使用して Quarkus サービスにアクセスする一般的なフローをエミュレートすることをお勧めします。

source: If you set `quarkus.oidc.devui.grant.type=code` in the `application.properties` file (this is a default value), then an `authorization_code` grant is used to acquire both access and ID tokens. Using this grant is recommended to emulate a typical flow where a single page application (SPA) acquires the tokens and uses them to access Quarkus services.
ja_jp: `application.properties` ファイルで `quarkus.oidc.devui.grant.type=code` を設定すると (これがデフォルト値です)、アクセストークンと ID トークンの両方を取得するために `authorization_code` グラントが使用されます。 シングルページアプリケーション (SPA) でトークンを取得し、それを使用して Quarkus サービスにアクセスする一般的なフローをエミュレートするには、このグラントを使用することを推奨します。

source: If you set `quarkus.oidc.devui.grant.type=implicit` in `application.properties` then an `implicit` grant will be used to acquire both access and ID tokens. Use this grant for emulating a `Single Page Application` only if the authorization code grant does not work (for example, a client is configured in Keycloak to support an implicit grant, etc).
ja_jp: `application.properties` で `quarkus.oidc.devui.grant.type=implicit` を設定すると、アクセストークンと ID トークンの両方を取得するために `implicit` グラントが使用されます。認可コードグラントが機能しない場合に限り (暗示的グラントをサポートするためにクライントが Keycloak に設定されている場合など)、このグラントを使用して `Single Page Application` をエミュレートします。

source: If you set `quarkus.oidc.devui.grant.type=implicit` in the `application.properties` file, then an `implicit` grant is used to acquire both access and ID tokens. Use this grant to emulate a single page application only if the authorization code grant does not work; for example, when a client is configured in Keycloak to support an implicit grant.
ja_jp: `application.properties` ファイルで `quarkus.oidc.devui.grant.type=implicit` を設定すると、アクセストークンと ID トークンの両方を取得するために `implicit` グラントが使用されます。 認可コードグラントが機能しない場合 (インプリシットグラントをサポートするためにクライントが Keycloak に設定されている場合) に限り、このグラントを使用してシングルページアプリケーションをエミュレートします。

source: If you set `quarkus.oidc.devui.grant.type=password` in `application.properties` then you will see a screen like this one:
ja_jp: `application.properties` で `quarkus.oidc.devui.grant.type=password` を設定すると、次のような画面が表示されます。

source: If you set `quarkus.oidc.devui.grant.type=password` in the `application.properties` file, then you see a screen similar to this one:
ja_jp: `application.properties` ファイルで `quarkus.oidc.devui.grant.type=password` を設定すると、次のような画面が表示されます。

source: If you set the `quarkus.package.fernflower.enabled` property to `true` then Quarkus will download and invoke the https://github.com/JetBrains/intellij-community/tree/master/plugins/java-decompiler/engine[Fernflower decompiler] and dump the result in the `decompiled` directory of the build tool output (`target/decompiled` for Maven for example).
ja_jp: `quarkus.package.fernflower.enabled` プロパティを `true` に設定すると、Quarkusは link:https://github.com/JetBrains/intellij-community/tree/master/plugins/java-decompiler/engine[Fernflowerのデコンパイラ]をダウンロードして起動し、その結果をビルドツールの出力の `decompiled` ディレクトリにダンプします（例えば、Mavenの場合は `target/decompiled` ）。

source: If you set the `quarkus.package.jar.decompiler.enabled` property to `true` then Quarkus will download and invoke the https://github.com/Vineflower/vineflower[Vineflower decompiler] and dump the result in the `decompiled` directory of the build tool output (`target/decompiled` for Maven for example). The output directory can be changed with `quarkus.package.jar.decompiler.output-dir`.
ja_jp: `quarkus.package.jar.decompiler.enabled` プロパティーを `true` に設定すると、Quarkus は https://github.com/Vineflower/vineflower[Vineflower decompiler] をダウンロードして呼び出し、その結果をビルドツール出力の `decompiled` ディレクトリー (たとえば Maven の場合は `target/decompiled`) にダンプします。 出力ディレクトリーは `quarkus.package.jar.decompiler.output-dir` で変更できます。

source: If you set the `quarkus.package.quiltflower.enabled` property to `true` then Quarkus will download and invoke the https://github.com/QuiltMC/quiltflower[Quiltflower decompiler] and dump the result in the `decompiled` directory of the build tool output (`target/decompiled` for Maven for example).
ja_jp: `quarkus.package.quiltflower.enabled` プロパティーを `true` に設定すると、Quarkus は https://github.com/QuiltMC/quiltflower[Quiltflower デコンパイラー] をダウンロードして呼び出し、結果をビルドツールの出力の `decompiled` ディレクトリー (たとえば Maven の場合は `target/decompiled`) にダンプします。

source: If you share your test class between JVM and native executions like we advise above, you can mark certain tests with the `@DisabledOnIntegrationTest` annotation in order to skip them when testing against a native image.
ja_jp: 上記のようにJVMとネイティブ実行でテストクラスを共有している場合、特定のテストをネイティブイメージに対してテストをするときに、 `@DisabledOnNativeImage` アノテーションを付けてそれらをスキップできます。

source: If you share your test class between JVM and native executions like we advise above, you can mark certain tests with the `@DisabledOnNativeImage` annotation in order to only run them on the JVM.
ja_jp: 上記のようにJVMとネイティブ実行でテストクラスを共有している場合、特定のテストをJVM上でのみ実行するために、 `@DisabledOnNativeImage` アノテーションを付けておくことができます。

source: If you start Consul differently, do not forget to edit the application configuration.
ja_jp: Consulを別の方法で起動する場合は、アプリケーションの設定を編集することを忘れないでください。

source: If you start the application in dev mode, Quarkus provides you with a https://quarkus.io/guides/databases-dev-services[zero-config database] out of the box.
ja_jp: アプリケーションを開発モードで起動すると、Quarkus はすぐに使用できる https://quarkus.io/guides/databases-dev-services[zero-config database] を提供します。

source: If you start your application in dev mode, `Dev Services for PostgreSQL` launches a `PostgreSQL` `devmode` container so that you can start developing your application. While developing your application, you can also start to add tests one by one and run them by using the xref:continuous-testing.adoc[Continuous Testing] feature. `Dev Services for PostgreSQL` supports testing while you develop by providing a separate `PostgreSQL` test container that does not conflict with the `devmode` container.
ja_jp: アプリケーションを開発モードで起動すると、 `Dev Services for PostgreSQL` が `PostgreSQL` `devmode` コンテナを起動し、アプリケーションの開発を開始することができるようになります。 アプリケーションの開発中に、xref:continuous-testing.adoc[継続的テスト] の機能を使って、テストを一つずつ追加して実行することも可能です。 `Dev Services for PostgreSQL` は、 `devmode` コンテナと衝突しない独立した `PostgreSQL` テストコンテナを提供することで、開発中のテストをサポートします。

source: If you started Dev Services for Keycloak without importing a realm file such as link:{quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[quarkus-realm.json], create a default `quarkus` realm without Keycloak authorization policies:
ja_jp: link:{quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[quarkus-realm.json] などのレルムファイルをインポートせずに Dev Services for Keycloak を開始した場合は、Keycloak 認可ポリシーなしでデフォルトの `quarkus` レルムを作成します。

source: If you stopped the application (keep in mind you don't have to do it, changes will be automatically deployed by our live reload feature), restart the application with:
ja_jp: アプリケーションを停止しなくても、ライブリロード機能によって変更が自動的にデプロイされますが、アプリケーションを停止した場合は、次のようにアプリケーションを再起動します。

source: If you support more than one social provider by using xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy], for example, Google, which is an OIDC provider that returns `IdToken`, and GitHub, which is an OAuth2 provider that does not return `IdToken` and only allows access to `UserInfo`, then you can have your endpoint working with only the injected `SecurityIdentity` for both Google and GitHub flows.
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシー] を使用して複数のソーシャルプロバイダー (たとえば、 `IdToken` を返す OIDC プロバイダーの Google と、 `IdToken` を返さず `UserInfo` へのアクセスのみを許可する OAuth2 プロバイダーの GitHub) をサポートする場合、Google フローと GitHub フローの両方で、注入された `SecurityIdentity` のみを使用してエンドポイントを動作させることができます。

source: If you support more than one social provider with the help of xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy], for example, Google which is an OpenID Connect Provider returning `IdToken` and GitHub which is an OAuth2 provider returning no `IdToken` and only allowing to access `UserInfo` then you can have your endpoint working with only the injected `SecurityIdentity` for both Google and GitHub flows. A simple augmentation of `SecurityIdentity` will be required where a principal created with the internally generated `IdToken` will be replaced with the `UserInfo` based principal when the GiHub flow is active:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシー] の利用で複数のソーシャルプロバイダーをサポートしている場合、例えば OpenID Connect プロバイダーである Google が `IdToken` を返し、OAuth2 プロバイダーである GitHub が `IdToken` を返さず `UserInfo` のみアクセスを許可していれば、エンドポイントには Google と GitHub 両フロー用の `SecurityIdentity` しか入れられないようにすることができます。GiHub フローがアクティブになると、内部で生成された `IdToken` で作成されたプリンシパルが `UserInfo` ベースのプリンシパルに置き換えられるので、 `SecurityIdentity` を単純に拡張する必要があります。

source: If you support more than one social provider with the help of xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy], for example, Google, which is an OIDC provider that returns `IdToken`, and GitHub, which is an OAuth2 provider that does not return `IdToken` and only allows access to `UserInfo`, then you can have your endpoint working with only the injected `SecurityIdentity` for both Google and GitHub flows. A simple augmentation of `SecurityIdentity` will be required where a principal created with the internally-generated `IdToken` will be replaced with the `UserInfo`-based principal when the GitHub flow is active:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy] を使用して複数のソーシャルプロバイダー (たとえば、 `IdToken` を返す OIDC プロバイダーの Google と、 `IdToken` を返さず `UserInfo` へのアクセスのみを許可する OAuth2 プロバイダーの GitHub) をサポートする場合、Google フローと GitHub フローの両方で、注入された `SecurityIdentity` のみを使用してエンドポイントを動作させることができます。 GitHub フローがアクティブな場合に、内部で生成された `IdToken` で作成されたプリンシパルが `UserInfo` ベースのプリンシパルに置き換えられる場合は、 `SecurityIdentity` の簡単な拡張が必要になります。

source: If you support more than one social provider with the help of xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy], for example, `Google` which is an OpenID Connect Provider returning `IdToken` and `GitHub` which is an `OAuth2` provider returning no `IdToken` and only allowing to access `UserInfo` then you can have your endpoint working with only the injected `SecurityIdentity` for both `Google` and `GitHub` flows. A simple augmentation of `SecurityIdentity` will be required where a principal created with the internally generated `IdToken` will be replaced with the `UserInfo` based principal when the GiHub flow is active:
ja_jp: OpenID Connect xref:security-openid-connect-multitenancy.adoc[Multi-Tenancy] を利用して複数のソーシャルプロバイダーをサポートする場合、例えば `IdToken` を返す OpenID Connect Provider である `Google` と `IdToken` を返さず `UserInfo` へのアクセスのみを許可する `OAuth2` Provider である `GitHub` があれば、 `Google` と `GitHub` 両フローに対して `SecurityIdentity` を注入するだけでエンドポイントを動作させることができます。GiHubフローがアクティブになると、内部で生成された `IdToken` で作成されたプリンシパルが `UserInfo` ベースのプリンシパルに置き換えられるため、 `SecurityIdentity` の単純なオーグメンテーションが必要となります:

source: If you think about it, we had to learn Quarkus __and__ redo everything from scratch. Now, after just a short period of time, we are deploying production-ready code. That is pretty darn cool, and it shows how easy it was to adopt Quarkus.
ja_jp: 考えてみれば、私たちはQuarkusを学び __そして、__ すべてを一からやり直さなければなりませんでした。今では、わずかな期間で本番対応のコードをデプロイしています。これは非常に素晴らしいことであり、Quarkusの導入がいかに簡単であったかを示しています。

source: If you try now to access the application at the following URL:
ja_jp: 次の URL でアプリケーションにアクセスを試みます。

source: If you turn off proactive authentication, the authentication process runs only when an identity is requested. An identity can be requested because of security rules that require the user to authenticate or because programmatic access to the current identity is required.
ja_jp: プロアクティブ認証をオフにすると、ID が要求されたときにのみ認証プロセスが実行されます。 ID が要求されるのは、ユーザ認証を必要とするセキュリティ・ルールがあるため、または現在の ID へのプログラムによるアクセスが必要なためです。

source: If you use <<dev-services,Dev Services>>, launching the container manually is not necessary!
ja_jp: link:#dev-services[Dev Services]を使用している場合は、手動でコンテナを起動する必要はありません。

source: If you use <<dev-services,Dev Services>>, launching the container manually is not necessary.
ja_jp: <<dev-services,Dev Services>> を使用する場合、コンテナーを手動で起動する必要はありません。

source: If you use Basic or form-based authentication, you must add an `IdentityProvider` instance to convert a username and password to a `SecurityIdentity` instance.
ja_jp: Basic認証またはフォーム・ベース認証を使用する場合は、 `IdentityProvider` インスタンスを追加して、ユーザー名とパスワードを `SecurityIdentity` インスタンスに変換する必要があります。

source: If you use Confluent Schema Registry, in this case you must define the `value.serializer` as well with the value `io.confluent.kafka.serializers.json.KafkaJsonSchemaSerializer`. It is also detected automatically. The Confluent Schema Registry analogue of `apicurio.registry.auto-register` is called `auto.register.schemas`. It defaults to `true`, so it doesn't have to be configured in this example. It can be explicitly set to `false` if you want to disable automatic schema registration.
ja_jp: Confluent Schema Registry を使用する場合、値 `io.confluent.kafka.serializers.json.KafkaJsonSchemaSerializer` を使用して `value.serializer` も定義する必要があります。 これは自動的に検出されます。 Confluent Schema Registry における `apicurio.registry.auto-register` の類似物は、`auto.register.schemas` と呼ばれるものです。 これはデフォルトで `true` に設定されているため、この例では設定する必要はありません。 自動スキーマ登録を無効にする場合は、明示的に `false` に設定できます。

source: If you use Confluent Schema Registry, you already have a Kafka broker and Confluent Schema Registry instance running and configured. You can ignore the `docker-compose` instructions here, as well as the Apicurio Registry configuration.
ja_jp: Confluent Schema Registry を使用している場合は、すでに Kafka ブローカーと Confluent Schema Registry インスタンスが実行および設定されています。ここに記した`docker-compose` や Apicurio Registry の設定に関する説明は無視してかまいません。

source: If you use Confluent Schema Registry, you don't have to configure `value.deserializer` or `specific.avro.reader` either. They are both detected automatically.
ja_jp: Confluent Schema Registry を使用する場合は、 `value.deserializer` や `specific.avro.reader` を設定する必要はありません。どちらも自動的に検出されます。

source: If you use Confluent Schema Registry, you don't have to configure `value.serializer` either. It is also detected automatically. The Confluent Schema Registry analogue of `apicurio.registry.auto-register` is called `auto.register.schemas`. It defaults to `true`, so it doesn't have to be configured in this example. It can be explicitly set to `false` if you want to disable automatic schema registration.
ja_jp: Confluent Schema Registry を使用する場合は、 `value.serializer` も設定する必要はありません。同様に、自動的に検出されます。 `apicurio.registry.auto-register` の Confluent Schema Registry アナログは、 `auto.register.schemas` と呼ばれます。デフォルトは `true` であるため、この例で設定する必要はありません。自動スキーマ登録を無効にする場合は、明示的に `false` に設定できます。

source: If you use Confluent Schema Registry, you don't need the `quarkus-apicurio-registry-avro` extension. Instead, you need the `quarkus-confluent-registry-avro` extension and a few more dependencies. See <<confluent>> for details.
ja_jp: Confluent Schema Registry を使用する場合、 `quarkus-apicurio-registry-avro` エクステンションは必要ありません。代わりに、 `quarkus-confluent-registry-avro` エクステンションと、さらにいくつかの依存関係が必要です。詳しくは、 <<confluent>> を参照下さい。

source: If you use Confluent Schema Registry, you don't need the `quarkus-apicurio-registry-avro` extension. Instead, you need the `quarkus-confluent-registry-avro` extension and a few more dependencies. See xref:confluent[Using the Confluent Schema Registry] for details.
ja_jp: Confluent Schema Registry を使用している場合、 `quarkus-apicurio-registry-avro` エクステンションは必要ありません。代わりに、 `quarkus-confluent-registry-avro` エクステンションとさらにいくつかの依存関係が必要です。詳細は xref:confluent[Confluent Schema Registry を使用する] を参照してください。

source: If you use Confluent Schema Registry, you don't need the `quarkus-apicurio-registry-avro` extension. Instead, you need the following dependencies and the Confluent Maven repository added to your build file:
ja_jp: Confluent Schema Registry を使用する場合、 `quarkus-apicurio-registry-avro` エクステンションは必要ありません。 代わりに、以下の依存関係と Confluent Maven リポジトリーをビルドファイルに追加する必要があります：

source: If you use Confluent Schema Registry, you don't need the `quarkus-apicurio-registry-json-schema` extension. Instead, you need the `quarkus-confluent-registry-json-schema` extension and a few more dependencies. See <<confluent>> for details.
ja_jp: Confluent Schema Registry を使用する場合、`quarkus-apicurio-registry-json-schema` エクステンションは必要ありません。 代わりに、`quarkus-confluent-registry-json-schema` エクステンションとさらにいくつかの依存関係が必要です。 詳細は、<<confluent>> を参照してください。

source: If you use Confluent Schema Registry, you must configure `value.deserializer` as well with the value ´io.confluent.kafka.serializers.json.KafkaJsonSchemaDeserializer´. They are both detected automatically.
ja_jp: Confluent Schema Registry を使用する場合は、値 ´io.confluent.kafka.serializers.json.KafkaJsonSchemaDeserializer´ を使用して `value.deserializer` も設定する必要があります。 どちらも自動的に検出されます。

source: If you use Gradle, you can simply add a dependency for the `quarkusDev` task:
ja_jp: Gradleを使用している場合は、 `quarkusDev` タスクの依存関係を追加するだけです。

source: If you use Hibernate ORM with Quarkus, you are probably already familiar with Hibernate ORM with Panache.
ja_jp: QuarkusでHibernate ORMを使用している場合、おそらくHibernate ORM with Panacheについてはすでにご存知でしょう。

source: If you use Hibernate ORM, you also need to configure `quarkus.hibernate-orm.dialect=org.hibernate.dialect.PostgreSQL10Dialect` as Hibernate ORM would not be able to automatically detect the dialect of your database.
ja_jp: Hibernate ORMを使用している場合、 `quarkus.hibernate-orm.dialect=org.hibernate.dialect.PostgreSQL10Dialect` を設定する必要があります。これは、Hibernate ORMがデータベースのダイアレクトを自動的に検出することができないことによるものです。

source: If you use Hibernate Reactive, look at <<persisting-kafka-messages-with-hibernate-reactive>>.
ja_jp: Hibernate Reactive を使用する場合は、<<persisting-kafka-messages-with-hibernate-reactive>> を参照してください。

source: If you use Hibernate Reactive, look at <<writing-entities-managed-by-hibernate-reactive-to-kafka>>.
ja_jp: Hibernate Reactive を使用する場合は、<<writing-entities-managed-by-hibernate-reactive-to-kafka>> を参照してください。

source: If you use Hibernate Reactive, look at xref:persisting-kafka-messages-with-hibernate-reactive[Persisting Kafka messages with Hibernate Reactive].
ja_jp: Hibernate Reactiveを使用する場合は、 xref:persisting-kafka-messages-with-hibernate-reactive[KafkaメッセージをHibernate Reactiveで永続化] をご覧ください。
